EDT/УТ/src/Documents/ВводОстатковПоВзаиморасчетамСКомитентами/ВводОстатковПоВзаиморасчетамСКомитентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатковПоВзаиморасчетамСКомитентами</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКомитентамиПоЗаказам</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКомитентами</registerRecords>
  <attributes>
    <name>ДатаДвижений</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СписыватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписаниеОстатковПоЗаказам</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Комитент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозникновенияЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВводОстатковПоЗаказам</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Комитент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозникновенияЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписаниеОстатков</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Комитент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозникновенияЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасчетовСКомитентами</name>
      <type>
        <types>CatalogRef.СтатьиРасчетовСКомитентами</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВводОстатков</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Комитент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозникновенияЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасчетовСКомитентами</name>
      <type>
        <types>CatalogRef.СтатьиРасчетовСКомитентами</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/ВзаиморасчетыСКомитентамиПоЗаказам/ВзаиморасчетыСКомитентамиПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКомитентамиПоЗаказам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВозникновенияЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/AccumulationRegisters/ВзаиморасчетыСКомитентами/ВзаиморасчетыСКомитентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКомитентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВозникновенияЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасчетовСКомитентами</name>
    <type>
      <types>CatalogRef.СтатьиРасчетовСКомитентами</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/ВводОстатковПоВзаиморасчетамСКомитентами/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьТекущимиОстатками(Команда)
	
	ЗаполнитьТекущимиОстаткамиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимиОстаткамиБезЗаказов(Команда)
	
	ЗаполнитьТекущимиОстаткамиБезЗаказовНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущимиОстаткамиНаСервере()
	
	Объект.СписаниеОстатковПоЗаказам.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыСКомитентамиОстатки.Организация КАК Организация,
		|	ВзаиморасчетыСКомитентамиОстатки.Комитент КАК Комитент,
		|	ВзаиморасчетыСКомитентамиОстатки.ДатаВозникновенияЗадолженности КАК ДатаВозникновенияЗадолженности,
		|	ВзаиморасчетыСКомитентамиОстатки.ТипЗаказа КАК ТипЗаказа,
		|	ВзаиморасчетыСКомитентамиОстатки.Заказ КАК Заказ,
		|	-ВзаиморасчетыСКомитентамиОстатки.СуммаОстаток КАК Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход) КАК ВидДвижения
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКомитентамиПоЗаказам.Остатки КАК ВзаиморасчетыСКомитентамиОстатки
		|ГДЕ
		//|	ВзаиморасчетыСКомитентамиОстатки.СуммаОстаток <> 0
		|	ВЫБОР
		|			КОГДА &Комитент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВзаиморасчетыСКомитентамиОстатки.Комитент = &Комитент
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Комитент", Объект.Комитент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.СписаниеОстатковПоЗаказам.Загрузить(РезультатЗапроса.Выгрузить());
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущимиОстаткамиБезЗаказовНаСервере()
	
	//СтатьяРасчетовСКомитентами
	
	Объект.СписаниеОстатков.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыСКомитентамиОстатки.Организация КАК Организация,
		|	ВзаиморасчетыСКомитентамиОстатки.Комитент КАК Комитент,
		|	ВзаиморасчетыСКомитентамиОстатки.ДатаВозникновенияЗадолженности КАК ДатаВозникновенияЗадолженности,
		|	-ВзаиморасчетыСКомитентамиОстатки.СуммаОстаток КАК Сумма,
		|	ВзаиморасчетыСКомитентамиОстатки.СтатьяРасчетовСКомитентами КАК СтатьяРасчетовСКомитентами,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход) КАК ВидДвижения
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКомитентами.Остатки КАК ВзаиморасчетыСКомитентамиОстатки
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Комитент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВзаиморасчетыСКомитентамиОстатки.Комитент = &Комитент
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Комитент", Объект.Комитент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.СписаниеОстатков.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

&НаСервере
Процедура ПродублироватьВведенныеЗаписиПоЗаказамНаСервере()
	
	Объект.ВводОстатков.Очистить();
	Объект.СписаниеОстатков.Очистить();
	
	ЗаписиВводаОстатков = Объект.ВводОстатковПоЗаказам.Выгрузить();
	ЗаписиВводаОстатков.Свернуть("Организация, Комитент, ДатаВозникновенияЗадолженности, Корректировка, ВидДвижения", "Сумма");	
	ЗаписиВводаОстатков.Колонки.Добавить("СтатьяРасчетовСКомитентами", Новый ОписаниеТипов("СправочникСсылка.СтатьиРасчетовСКомитентами"));
	ЗаписиВводаОстатков.ЗаполнитьЗначения(Справочники.СтатьиРасчетовСКомитентами.ВыручкаПоЗаказам, "СтатьяРасчетовСКомитентами");

	Объект.ВводОстатков.Загрузить(ЗаписиВводаОстатков);
	
	
	ЗаписиСписанияОстатков = Объект.СписаниеОстатковПоЗаказам.Выгрузить();
	ЗаписиСписанияОстатков.Свернуть("Организация, Комитент, ДатаВозникновенияЗадолженности, Корректировка, ВидДвижения", "Сумма");	
	ЗаписиСписанияОстатков.Колонки.Добавить("СтатьяРасчетовСКомитентами", Новый ОписаниеТипов("СправочникСсылка.СтатьиРасчетовСКомитентами"));
	ЗаписиСписанияОстатков.ЗаполнитьЗначения(Справочники.СтатьиРасчетовСКомитентами.ВыручкаПоЗаказам, "СтатьяРасчетовСКомитентами");

	Объект.СписаниеОстатков.Загрузить(ЗаписиСписанияОстатков);

КонецПроцедуры

&НаКлиенте
Процедура ПродублироватьВведенныеЗаписиПоЗаказам(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПродублироватьЗаписиПоЗаказам", ЭтотОбъект), "При дублировании записей табл.части ВводОстатков и СписаниеОстатков будут очищены. Продолжить?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродублироватьЗаписиПоЗаказам(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса =КодВОзвратаДиалога.Да Тогда
		
		ПродублироватьВведенныеЗаписиПоЗаказамНаСервере();

	Конецесли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПодборЗаказов(Команда)
	
	СтруктураОтбора = Новый Структура("ВладелецТовара", Объект.Комитент); 
	ПараметрыОткрытия = Новый Структура("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("Документ.ВводОстатковПоВзаиморасчетамСКомитентами.Форма.ФормаПодбораЗаказов", ПараметрыОткрытия, Элементы.ВводОстатковПоЗаказам,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	//ПодборЗаказовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодборЗаказовНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаказам(Команда)
	
	Объект.ВводОстатков.Очистить();
	
	Для каждого ТекСтрока Из Объект.ВводОстатковПоЗаказам Цикл
		НС = Объект.ВводОстатков.Добавить();
		ЗаполнитьЗначенияСвойств(НС, ТекСтрока);
		НС.СтатьяРасчетовСКомитентами = ПредопределенноеЗначение("Справочник.СтатьиРасчетовСКомитентами.ВыручкаПоЗаказам");
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ВводОстатковПоЗаказамОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли; 
	
	ДанныеСтроки = ПолучитьДанныеЗаказа(ВыбранноеЗначение);
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.Заказ) Тогда
		Сообщить("Не найдено данных по заказу "+ВыбранноеЗначение);
		Возврат;
	КонецЕсли; 
	
	НС = Объект.ВводОстатковПоЗаказам.Добавить();
	ЗаполнитьЗначенияСвойств(НС, ДанныеСтроки);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЗаказа(Заказ)

	СтруктураПолей = Новый Структура(); 
	Для каждого Колонка Из Объект.СписаниеОстатковПоЗаказам.Выгрузить().Колонки Цикл
		СтруктураПолей.Вставить(Колонка.Имя);	
	КонецЦикла; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВзаиморасчетыСКомитентамиПоЗаказамОбороты.Период КАК Период,
		|	ВзаиморасчетыСКомитентамиПоЗаказамОбороты.Регистратор КАК Регистратор,
		|	ВзаиморасчетыСКомитентамиПоЗаказамОбороты.Организация КАК Организация,
		|	ВзаиморасчетыСКомитентамиПоЗаказамОбороты.Комитент КАК Комитент,
		|	ВзаиморасчетыСКомитентамиПоЗаказамОбороты.ДатаВозникновенияЗадолженности КАК ДатаВозникновенияЗадолженности,
		|	ВзаиморасчетыСКомитентамиПоЗаказамОбороты.ТипЗаказа КАК ТипЗаказа,
		|	ВзаиморасчетыСКомитентамиПоЗаказамОбороты.Заказ КАК Заказ,
		|	ВзаиморасчетыСКомитентамиПоЗаказамОбороты.СуммаОборот КАК Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход) КАК ВидДвижения
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКомитентамиПоЗаказам.Обороты(, , Регистратор, Заказ = &Заказ) КАК ВзаиморасчетыСКомитентамиПоЗаказамОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПолей, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат СтруктураПолей;
	
КонецФункции // ()
